do
function run(msg, matches)
  return [[⚙لیست دستورات سرگرمی و مهم گروه⚙

!msggroup
با این دستور میتونی ببینی امروز تو گروه فعال بودی یا نه

!praytime شهر
با این دستور میتونی (اذان صبح،طلوع آفتاب.....) رو مشاهده کنی

!time
با این دستور میتونی (ساعت،تاریخ) رو بدونی

!calc عدد
با این دستور میتونی ماشین حساب انجام بدی

!aparat کلمه
با این دستور میتونی تو آپارات سرچ کنی

!wiki search کلمه
با این دست میتونی تو ویکی پدیا سرچ کنی

!arz
با این دستور میتونی قیمت بروز طلا،سکه،نرخ ارز رو ببینی

!tr en سلام
!tr fa hi
ترجمه گر هر زبانی

!webshot لینک سایت
اسکرین شات از سایت مورد نظر شما

!qrcode عدد یا اسم
تبدیل هر چیزی به بارکد معتبر

!myinfo
دریافت اطلاعات کامل خود

!sticker
تبدیل عکس به استیکر(نحوه کار : عکس را ارسال کنید و سپس روی عکس Reply کنید و !sticker را ارسال کنید)

!music اسم خواننده
!dl شماره آهنگ
سرچ آهنگ و دانلود آهنگ (نحوه کار : مثال !music Tohi را ارسال میکنیم سپس لیستی از آهنگ میاید کنار هر آهنگ به ترتیب عدد زده است هر کدام از آهنگ را که دوست داشتید با دستور !dl دانلود کنید)


!dogify کلمه
نوشتن متن روی عکس سگ

!writer کلمه
متن خود را با این دستور میتوانید زیبا کنید

🔹🔹🔹🔹🔹🔹🔹🔹
🔼برای دریافت نخسه ربات کافیست #version را ارسال کنید.

🔼شما فقط میتوانید از ! استفاده کنید

🔼 کانال مارا جهت آپدیت دنبال کنید : @SoftTG_TEAM

🔼آیدی ربات آنتی اسپم : @Soft_TG
🔹🔹🔹🔹🔹🔹🔹🔹
]]
end

return {
  description = "shield",
  patterns = {"^[!/%$+=.-*&][Hh]elpfun$"},
  run = run 
}
end
