do
 function run(msg, matches)
 if is_momod(msg) then
return [[همانطور که میدانید، اکثر گوشی ها دارای یک سری کدهای مخفی و کاربردی می باشند که هر کدام از این کد ها برای نمایش اطلاعاتی در مورد عملکرد و تست برخی از قسمت های گوشی کاربرد دارد.

در این مطلب نیز مجموعه ای کامل از کد های پرکاربرد گوشی های اندروید ی را برای شما آماده نموده ایم که با مراجعه به ادامه مطلب می توانید آنها را مشاهده کنید.

 

توجه: از انجا که استفاده از برخی کدها سبب فرمت شدن گوشی و از بین رفتن تمام اطلاعات شما می شود بهتر است قبل از استفاده از هر کد توضیحات مربوط به آن را با دقت مطالعه کنید.

 

#۰۶#*- شماره ی IMEI ( شماره شناسایی بین المللی تلفن )

#*#۴۶۳۶#*#* – تمام اطلاعات مربوط به گوشی  را نمایش می دهد.

*#*#*۶۶۳۲۸۲*۲۵۵*#۲۷۳۲۸۲*#*- پشتیبان گیری از فایل های رسانه ای

*#*#۰۵۸۸#*#* –  تست مجاورت حسگر

*#*#۰۲۸۹#*#* – تست صدا

*#*#۱۹۷۳۲۸۶۴۰#*#* –  فعال کردن حالت تست برای سرویس

*#*#۷۲۶۲۶۲۶#*#* –  انجام یک تست میدانی

*#*#۷۷۸۰#*#* – بازگشت پارتیشن‌بندی داده‌ها به حالت کارخانه

*#*#۳۴۹۷۱۵۳۹#*#* –   نمایش تمام اطلاعات جزئی  درباره دوربین

 #۷۴۶۵۶۲۵#* – نمایش وضعیت قفل گوشی

۳۶۹#*#۱۲۵۸۰* –  اطلاعات سخت‌افزاری و نرم افزاری

#۳۰۱۲۷۹#* – منوی کنترل HSDPA/HSUPA

*#*#۸۲۵۵#*#* –  شروع مانیتورینگ  گوگل‌تاک

*#*#۸۳۵۰#*#* – غیر فعال کردن شماره گیری صوتی

*#*#۷۵۹۴#*#* – خاموش شدن دستگاه به‌محض واردکردن این کد

*#*۲۶۵۰۴۶۸#*#۴۹۸۶*#* – نمایش تلفن، سخت‌افزار، PDA و فرکانس رادیویی اطلاعات سیستم‌عامل

*#*#۴۴۳۳۶#*#* –  نمایش تاریخ ساخت و تغییر لیست شماره

*#*#۳۲۶۴#*#*- نمایش ورژن رم مموری

#*#۰* – منوی سرویس در گوشی های جدید

*#*#۲۲۲۲#*#*- نشان دادن نسخه‌ی سخت‌افزاری FTA

*#*#۱۱۱۱#*#*- نشان دادن ورژن نرم افزاری FTA

*#*#۲۶۶۳#*#*- نمایش ورژن صفحه لمسی

*#*#۲۶۶۳#*#*-  تست صفحه‌نمایش لمسی

۳۸۵۵#*۲۷۶۷* – فرمت کردن تلفن

*#*#*#۰*#* – تست صفحه‌نمایش LCD

#۹۰۹۰#* –  هویت پیکربندی

#۸۷۲۵۶۴#* –  کنترل ورود و خروج USB

#۹۹۰۰#* –  حالت زباله‌ای سیستم

*#*#۸۳۵۱#*#* –  فعال کردن حالت شماره‌گیری صوتیė

*#*#۲۳۲۳۳۱#*#* – تست بلوتوس

##۷۷۶۴۷۲۶ –  منوی سرویس پنهان برای موتورولا

#*#۲۳۲۳۳۷#*# –  آدرس بلوتوث دستگاه

*#*#۱۴۷۲۳۶۵#*#* – تست سریع GPS

*#*#۱۵۷۵#*#* –  تست پیشرفته‌ی GPS

*#*#۲۳۲۳۳۹#*#* – تست LAN بی‌سیم

*#*#۲۳۲۳۳۸#*#* –  آدرس وای‌فای مک را نشان می‌دهد

*#*#۰۸۴۲#*#* – تست ویبره و نور پس‌زمینه

Bot id : @Soft_TG ]]
end
end
return {
patterns = {
"^(razandroid)$",
},
run = run
}
end

--کپی بدون ذکر منبع حرام است.